ci4/app/Controllers/AjaxController.php

    public function getData()
    {
        $model = new ArtikelModel();
        $data = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC

    public function delete($id)
    {
        $model = new ArtikelModel();
        $model->delete($id);
---
DELETE FROM `artikel`
WHERE `id` IN ('9')

    public function add()
    {
        $model = new ArtikelModel();

        $model->insert([
            'judul'  => $this->request->getPost('judul'),
            'isi'    => $this->request->getPost('isi'),
            'slug'   => url_title($this->request->getPost('judul'), '-', TRUE),
            'status' => 'Aktif'
        ]);
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`, `status`) VALUES ('Artikel Baru Ajax', 'Ajax amsterdam', 'artikel-baru-ajax', 'Aktif')

    public function edit($id)
    {
        $model = new ArtikelModel();
        $data = $model->find($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '11'