ci4/app/Controllers/Artikel.php

    public function admin_index()
    {
        $title = 'Daftar Artikel (Admin)';
        $model = new ArtikelModel();

        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';

        $data = [
            'title'       => $title,
            'q'           => $q,
            'kategori_id' => $kategori_id,
        ];

        $builder = $model->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

        if ($q != '') {
            $builder->like('artikel.judul', $q);
        }

        if ($kategori_id != '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $data['artikel'] = $builder->paginate(4);
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%Mahfuz%' ESCAPE '!'
AND `artikel`.`id_kategori` = '1'
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%Mahfuz%' ESCAPE '!'
AND `artikel`.`id_kategori` = '1'
 LIMIT 4

        // --- PERBAIKAN ERROR DI SINI ---
        // Menembak alamat folder Models secara langsung
        $kategoriModel = new \App\Models\KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

        }

        $kategoriModel = new \App\Models\KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`