ci4/app/Controllers/Post.php

    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getVar('judul'),
            'isi'   => $this->request->getVar('isi'),
            'slug'  => url_title($this->request->getVar('judul'), '-', TRUE),
            'status'=> 'Aktif'
        ];

        $model->insert($data);
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`, `status`) VALUES ('Judul Artikel 4', '', 'judul-artikel-4', 'Aktif')

    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->first();
---
SELECT *
FROM `artikel`
WHERE `id` = '4'
 LIMIT 1